print('«Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .»')

wd1 = input('Введите недостающее слово')
wd2 = input('Введите недостающую букву')
wd3 = input('Введите недостающее слово')
wd4 = input('Введите недостающую букву')
wd5 = input('Введите недостающее слово')
wd6 = input('Введите недостающее слово')
wd7 = input('Введите недостающую букву')

print(f'«Шляпка гриба, покрытая {wd1} кожиц', wd2, 'й, держится на,', wd3, 'ножк', wd4, '. Снизу шляпка затянута', wd5, 'плёнкой. Когда её уберёшь, откроется нижняя', wd6, 'сторона шляпк', wd7, '.')